# Wczytanie pliku modelu
    read_verilog -sv exe_unit_w15.sv

# Utworzenie kopi modulu z inna nazwa
    copy exe_unit_w15 exe_unit_w15_rtl

# Ustawienie hierarchii projektu na nowy modul 
    hierarchy -top exe_unit_w15_rtl

# Synteza logiczna
    synth

# Mapowanie na bramki
    abc -g AND,OR,XOR

# Optymalizacja po mapowaniu
    opt_clean

# Zapis wyniku symulacji
    write_verilog -noattr exe_unit_w15_rtl.sv
    
# Wypisanie statystyki uzytych bramek
    stat -tech cmos